* Template
|----------------------------+-------+--------+-------+-----------|
| Configuration              | First | Second | Third | Average   |
|----------------------------+-------+--------+-------+-----------|
| Example with one train     |       |        |       | vmean([]) |
| Example with two trains    |       |        |       | vmean([]) |
| Shared Segment             |       |        |       | vmean([]) |
| Large Network              |       |        |       | vmean([]) |
| Station One                |       |        |       | vmean([]) |
| Station Two                |       |        |       | vmean([]) |
| Station Four               |       |        |       | vmean([]) |
| Station Six                |       |        |       | vmean([]) |
| Station Eight              |       |        |       | vmean([]) |
| Station Ten                |       |        |       | vmean([]) |
| Station Twelfth            |       |        |       | vmean([]) |
| Two trains same direction  |       |        |       | vmean([]) |
| Four trains same direction |       |        |       | vmean([]) |
| Nærumbanen (2T)            |       |        |       | vmean([]) |
|----------------------------+-------+--------+-------+-----------|
#+TBLFM: $5=vmean($2..$4)


* No derailment (Move between connected segments)
** Elapsed time
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   0.003 |   0.002 |   0.002 | vmean([]) |
| Example with two trains    |    0.02 |   0.018 |   0.013 | vmean([]) |
| Shared Segment             |   0.017 |   0.015 |   0.013 | vmean([]) |
| Large Network              |   0.011 |   0.014 |   0.017 | vmean([]) |
| Station One                |   0.013 |   0.009 |   0.012 | vmean([]) |
| Station Two                |   0.074 |   0.076 |   0.075 | vmean([]) |
| Station Four               |    1.69 |   1.715 |   1.755 | vmean([]) |
| Station Six                |  27.474 |  27.433 |  27.203 | vmean([]) |
| Station Eight              | 165.631 | 165.800 | 165.955 | vmean([]) |
| Station Ten                | 585.126 | 587.348 |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   0.014 |   0.019 |   0.016 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  24.112 |  24.158 |  24.186 | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.988 |   5.996 |   6.004 | vmean([]) |
| Example with two trains    |   6.512 |   6.528 |   6.538 | vmean([]) |
| Shared Segment             |   7.464 |   7.472 |   7.516 | vmean([]) |
| Large Network              |   8.928 |   8.960 |   8.972 | vmean([]) |
| Station One                |   6.472 |   6.492 |   6.500 | vmean([]) |
| Station Two                |   9.252 |   9.288 |   9.296 | vmean([]) |
| Station Four               |  29.580 |  29.672 |  29.688 | vmean([]) |
| Station Six                |  69.912 |  70.192 |  70.200 | vmean([]) |
| Station Eight              | 205.372 | 205.396 | 205.404 | vmean([]) |
| Station Ten                | 312.244 | 312.264 |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   7.488 |   7.496 |   7.540 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  78.428 |  78.824 |  78.828 | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No derailment (Critical section)
** Elapsed time
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   0.001 |   0.003 |   0.004 | vmean([]) |
| Example with two trains    |   0.015 |   0.021 |   0.021 | vmean([]) |
| Shared Segment             |   0.009 |   0.014 |    0.02 | vmean([]) |
| Large Network              |   0.017 |   0.017 |   0.015 | vmean([]) |
| Station One                |   0.012 |   0.011 |   0.012 | vmean([]) |
| Station Two                |   0.068 |   0.077 |   0.075 | vmean([]) |
| Station Four               |   1.679 |   1.723 |   1.721 | vmean([]) |
| Station Six                |  29.505 |  29.477 |  29.470 | vmean([]) |
| Station Eight              | 166.133 | 164.812 | 164.793 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   0.022 |   0.015 |   0.019 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  24.004 |  24.091 | 24.111  | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.984 |   5.996 |   5.996 | vmean([]) |
| Example with two trains    |   6.500 |   6.512 |   6.516 | vmean([]) |
| Shared Segment             |   7.460 |   7.464 |   7.468 | vmean([]) |
| Large Network              |   8.920 |   8.944 |   8.948 | vmean([]) |
| Station One                |   6.464 |   6.480 |   6.480 | vmean([]) |
| Station Two                |   9.252 |   9.276 |   9.280 | vmean([]) |
| Station Four               |  25.772 |  25.848 |  25.860 | vmean([]) |
| Station Six                |  69.912 |  70.168 |  70.180 | vmean([]) |
| Station Eight              | 158.408 | 158.508 | 158.508 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   7.484 |   7.488 |   7.492 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  78.428 |  78.800 |  78.808 | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* No collision
** Elapsed time
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   0.002 |   0.003 |   0.004 | vmean([]) |
| Example with two trains    |   0.022 |   0.024 |   0.015 | vmean([]) |
| Shared Segment             |   0.014 |   0.014 |   0.014 | vmean([]) |
| Large Network              |   0.011 |   0.015 |   0.021 | vmean([]) |
| Station One                |   0.007 |    0.01 |   0.008 | vmean([]) |
| Station Two                |   0.082 |   0.093 |   0.081 | vmean([]) |
| Station Four               |   1.702 |   1.911 |   1.738 | vmean([]) |
| Station Six                |  29.678 |  29.678 |  29.803 | vmean([]) |
| Station Eight              | 164.477 | 165.993 | 165.677 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   0.016 |   0.019 |   0.019 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  24.081 |  24.345 |  24.339 | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   6.000 |   6.016 |   6.020 | vmean([]) |
| Example with two trains    |   6.528 |   6.552 |   6.572 | vmean([]) |
| Shared Segment             |   7.468 |   7.520 |   7.532 | vmean([]) |
| Large Network              |   8.932 |   8.972 |   8.988 | vmean([]) |
| Station One                |   6.484 |   6.524 |   6.536 | vmean([]) |
| Station Two                |   9.268 |   9.308 |   9.324 | vmean([]) |
| Station Four               |  25.792 |  25.880 |  25.896 | vmean([]) |
| Station Six                |  69.916 |  70.200 |  70.220 | vmean([]) |
| Station Eight              | 158.424 | 158.440 | 158.628 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   7.496 |   7.548 |   7.560 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  78.436 |  78.828 |  78.888 | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

* Will arrive
** Elapsed time
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   0.002 |   0.003 |   0.003 | vmean([]) |
| Example with two trains    |   0.023 |   0.018 |   0.013 | vmean([]) |
| Shared Segment             |    0.01 |    0.01 |    0.01 | vmean([]) |
| Large Network              |   0.013 |    0.02 |    0.02 | vmean([]) |
| Station One                |   0.012 |   0.008 |    0.01 | vmean([]) |
| Station Two                |   0.082 |   0.067 |   0.081 | vmean([]) |
| Station Four               |   1.679 |    1.74 |   1.715 | vmean([]) |
| Station Six                |  27.342 |  27.453 |  27.331 | vmean([]) |
| Station Eight              | 163.763 | 163.562 | 162.250 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   0.018 |   0.017 |   0.018 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  23.900 |  23.947 | 23.908  | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)

** Memory Usage Peak
|----------------------------+---------+---------+---------+-----------|
| Configuration              |   First |  Second |   Third | Average   |
|----------------------------+---------+---------+---------+-----------|
| Example with one train     |   5.956 |   5.960 |   5.960 | vmean([]) |
| Example with two trains    |   6.468 |   6.472 |   6.472 | vmean([]) |
| Shared Segment             |   7.436 |   7.436 |   7.436 | vmean([]) |
| Large Network              |   8.888 |   8.904 |   8.908 | vmean([]) |
| Station One                |   6.436 |   6.440 |   6.440 | vmean([]) |
| Station Two                |   9.216 |   9.232 |   9.236 | vmean([]) |
| Station Four               |  25.736 |  25.804 |  25.804 | vmean([]) |
| Station Six                |  69.812 |  70.064 |  70.068 | vmean([]) |
| Station Eight              | 158.152 | 158.152 | 158.236 | vmean([]) |
| Station Ten                |         |         |         | vmean([]) |
| Station Twelfth            |         |         |         | vmean([]) |
| Two trains same direction  |   7.460 |   7.460 |   7.460 | vmean([]) |
| Four trains same direction |         |         |         | vmean([]) |
| Nærumbanen (2T)            |  78.392 |  78.704 |  78.704 | vmean([]) |
|----------------------------+---------+---------+---------+-----------|
#+TBLFM: $5=vmean($2..$4)
